Return the number of light types contained in this light family
  Namespace:   Autodesk.Revit.DB.Lighting
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2013
 Syntax
  C#
public int GetNumberOfLightTypes()
  Visual Basic
Public Function GetNumberOfLightTypes As Integer
  Visual C++
public:
int GetNumberOfLightTypes()
 Return Value
 The number of light types contained in this light family
 See Also
  LightFamily Class
  Autodesk.Revit.DB.Lighting Namespace